import { Box, Heading, Image, Stack, Text } from "@chakra-ui/react";
import Layout from "../components/layout";

const About = () => {
  return (
    <Layout>
      <Stack color="gray.600" direction="column" gap={2} py={6}>
        <Heading as="h1">เกี่ยวกับเรา</Heading>
        <Text>
          การใช้คลื่นไฟฟ้าหัวใจ (Electrocardiogram, ECG)
          เป็นหนึ่งในวิธีพื้นฐานที่แพทย์ใช้ในการตรวจสอบความผิดปกติหัวใจในปัจจุบัน
          ด้วยราคาและความรวดเร็วในการวัดผลทำให้แพทย์สามารถนำไปใช้ในการตรวจสอบในขั้นถัดไปได้อย่างมีประสิทธิภาพมากยิ่งขึ้น
          แต่ทั้งนี้การเข้าถึงแพทย์ที่จะเข้าใจภาพคลื่นไฟฟ้าหัวใจเป็นไปได้ยาก
          การใช้โมเดลทำนายที่มีประสิทธิภาพจึงเข้ามามีส่วนในการช่วยแพทย์ในการอ่านภาพคลื่นไฟฟ้าหัวใจได้อย่างมีประสิทธิภาพมากยิ่งขึ้น
          คณะวิจัยจึงเล็งเห็นความสำคัญของการนำโมเดลมาพัฒนาต่อยอดเป็นแอพพลิเคชั่นเพื่อให้แพทย์หรือผู้ป่วยสามารถเข้าถึงได้
          และพัฒนาแอพพลิเคชั่นหทัย AI ขึ้นมา
        </Text>
        <Text>
          หทัย AI เป็นแอพพลิเคชั่นที่สร้างขึ้นจากความร่วมมือระหว่างห้องทดลองของ
          ศ.นพ. รุ่งโรจน์ กฤตยพงษ์ ศูนย์โรคหัวใจ และ ดร.ฐิติพัทธ
          อัชชะกุลวิสุทธิ์​ ภาควิชาวิศวกรรมชีวการแพทย์ มหาวิทยาลัยมหิดล
          เพื่อช่วยให้การวินิจฉัยโรคหัวใจจากภาพคลื่นไฟฟ้าหัวใจทำได้อย่างมีประสิทธิภาพและเข้าถึงได้จากทุกพื้นที่
          เพื่อใช้ในการรักษาโรคหัวใจกับผู้ป่วยในอนาคต
        </Text>
        <Text>
          หมายเหตุ: แอพพลิเคชั่นนี้จัดทำขึ้นเพื่อใช้ในการวิจัย
          ไม่มีการเก็บข้อมูลของการอัพโหลดไฟล์ใดๆ
        </Text>
        <Stack direction={{ base: "column", md: "row" }} gap={2}>
          <Box px={{ base: 4, md: 14 }}>
            <Image src="/images/si-logo.png" alt="SI Logo" />
          </Box>
          <Box px={{ base: 4, md: 14 }}>
            <Image src="/images/mu-logo.png" alt="MU Logo" />
          </Box>
        </Stack>
      </Stack>
    </Layout>
  );
};

export default About;
