import {
  Box,
  Flex,
  Heading,
  HeadingProps,
  Icon,
  ListItem,
  ListItemProps,
  ListProps,
  OrderedList,
  Text,
  TextProps,
  UnorderedList,
  VStack,
} from "@chakra-ui/react";
import { BlockquoteHTMLAttributes } from "react";
import { BiLock } from "react-icons/bi";
import Layout from "../components/layout";

const H = (props: HeadingProps) => (
  <Heading as="h6" color="gray.900" fontSize="2xl" mb={4} {...props} />
);
const T = (props: TextProps) => (
  <Text as="p" color="gray.900" mb={3} {...props} />
);
const OL = (props: ListProps) => (
  <OrderedList color="gray.900" ml={8} mb={2} {...props} />
);
const UL = (props: ListProps) => (
  <UnorderedList color="gray.900" ml={8} mb={2} {...props} />
);
const LI = (props: ListItemProps) => (
  <ListItem color="gray.900" mb={1} {...props} />
);
const BQ = (props: BlockquoteHTMLAttributes) => (
  <Box bg="gray.100" borderRadius="md" p={{ base: 4, md: 6 }} mb={3}>
    <blockquote {...props} />
  </Box>
);

const PrivacyPolicy = () => {
  return (
    <Layout>
      {/* hacky bg color */}
      <Box>
        <Flex
          bg="gray.200"
          w="100vw"
          h="100vh"
          position="fixed"
          top={0}
          left={0}
          zIndex={-1}
        />
      </Box>

      {/* main container */}
      <Box my={12}>
        <VStack>
          {/* header block */}
          <Box
            w="100%"
            bgColor="secondary.400"
            borderRadius="xl"
            px={4}
            py={{ base: 10, md: 14 }}
            mb={4}
          >
            <Flex
              direction={{ base: "column", md: "row" }}
              align="center"
              justify="center"
              textAlign="center"
              fontWeight={600}
              color="white"
              fontSize={{ base: "4xl", md: 40 }}
            >
              <Icon
                as={BiLock}
                fontSize="85%"
                mr={{ md: 2 }}
                mb={{ base: 2, md: 0 }}
              />
              <Heading as="h1">นโยบายความเป็นส่วนตัว</Heading>
            </Flex>
          </Box>

          {/* content block */}
          <Box
            w="100%"
            bgColor="white"
            borderRadius="xl"
            px={{ base: 4, md: 8 }}
            py={{ base: 6, md: 10 }}
            mb={4}
          >
            <VStack align="start" gap={2}>
              <Box>
                <H>บทนำ</H>
                <T>
                  ศูนย์โรคหัวใจโรงพยาบาลศิริราช และห้องปฏิบัติการ Biomedical and
                  data lab คณะวิศวกรรมศาสตร์ มหาวิทยาลัยมหิดล (“เรา”)
                  มุ่งมั่นที่จะปกป้องความเป็นส่วนตัวของท่าน
                  ซึ่งข้อมูลต่อไปนี้คือแนวทางที่เราปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน
                  ไม่ว่าจะเป็น การเก็บรวบรวม, การใช้, การเปิดเผย (เรียกรวมกันว่า
                  “การประมวลผล”)
                  และการปกป้องซึ่งข้อมูลส่วนบุคคลที่ท่านให้กับเราในระหว่างเยี่ยมชมเว็บไซต์หรือใช้แอพพลิเคชั่นของเรา
                  หรือรับบริการจากเรา
                  นโยบายความเป็นส่วนตัวนี้ครอบคลุมถึงข้อมูลใด ๆ
                  ที่สามารถระบุถึงตัวท่านได้ไม่ว่าทางตรงหรือทางอ้อม
                  และไม่ว่าจะได้รับจากท่านโดยตรงหรือเป็นการส่งต่อมาจากบุคคลที่สามก็ตาม
                  (“ข้อมูล” หรือ “ข้อมูลส่วนบุคคล”)
                  สำหรับข้อมูลส่วนบุคคลด้านสุขภาพของท่านนั้น
                  นอกเหนือจากการปฏิบัติตามนโยบายนี้แล้ว
                  เราจะยึดถือปฏิบัติตามบทบัญญัติของกฎหมาย กฎ ประกาศ
                  คำสั่งหรือระเบียบของหน่วยงานที่มีอำนาจกำกับดูแลที่เกี่ยวข้อง
                  หรือที่จะมีการแก้ไขเพิ่มเติม
                  เราในฐานะผู้ควบคุมข้อมูลส่วนบุคคลของท่าน
                  ได้จัดทำนโยบายความเป็นส่วนตัวนี้ขึ้น
                  ซึ่งถือเป็นส่วนหนึ่งของข้อกำหนดและเงื่อนไขสำหรับการให้บริการเว็บไซต์และแอพพลิเคชั่นของเรา
                  รวมทั้งการเข้ารับบริการของท่าน
                  โดยในการใช้บริการดังกล่าวในแต่ละครั้งให้ถือว่าท่านได้อ่านและตกลงยอมรับนโยบายความเป็นส่วนตัวนี้
                  ซึ่งมีรายละเอียดดังต่อไปนี้
                </T>
              </Box>

              <Box>
                <H>การเก็บรวบรวมข้อมูลส่วนบุคคล</H>
                <T>
                  เราเก็บข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็นในการประมวลผลผ่านแอพพลิเคชั่น
                  ไม่ว่าจะเป็นการให้ข้อมูลเพื่อการขอรับบริการจากเราผ่านช่องทางเว็บไซต์
                  แอพพลิเคชั่นบนมือถือ หรือช่องทางอื่นใดของเรา เช่น
                  การอัพโหลดสัญญาณคลื่นไฟฟ้าหัวใจ การทำแบบประเมินความเสี่ยง
                  หรือการทำแบบสอบถามเพื่อนำมาใช้พัฒนาแอพพลิเคชั่นในอนาคต
                </T>
              </Box>

              <Box>
                <H>ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม</H>
                <T>
                  ประเภทของข้อมูลส่วนบุคคลที่เราเก็บรวบรวมจะขึ้นอยู่กับวัตถุประสงค์ในการประมวลผลข้อมูลตามนโยบายความเป็นส่วนตัวนี้
                  ซึ่งเป็นข้อมูลส่วนบุคคลที่เราเก็บรวบรวมโดยตรงจากท่าน
                  หรือจากบุคคลที่สาม มีดังนี้
                </T>

                <OL>
                  <LI>ข้อมูลระบุตัวตน เช่น ชื่อ ชื่อผู้ใช้งาน ปีเกิด อีเมล์</LI>
                  <LI>
                    ข้อมูลสถิติ เช่น การเข้าชมเว็บไซต์
                    การใช้งานแอพพลิเคชั่นผ่านคอมพิวเตอร์ แทบเล็ต หรือมือถือ
                  </LI>
                  <LI>
                    ข้อมูลจากการเข้าใช้เว็บไซต์ของเรา เช่น IP Address, Cookies
                  </LI>
                  <LI>
                    ข้อมูลด้านสุขภาพ รายงานที่เกี่ยวกับสุขภาพกาย
                    ผลการตรวจสุขภาพและการวินิจฉัยในอดีต
                    เพื่อใช้ในการประเมินความเสี่ยง
                  </LI>
                  <LI>
                    ข้อมูลแบบสอบถาม (Feedback) เพื่อใช้พัฒนาแอพพลิเคชั่นในอนาคต
                  </LI>
                  <LI>
                    เราจะไม่เก็บและใช้ข้อมูลที่มีความละเอียดอ่อนในการรักษาของท่านผ่านการประมวลผล
                    ได้แก่ ข้อมูลที่ท่านใส่ระหว่างการทำแบบสอบถาม
                    และข้อมูลภาพสแกนคลื่นไฟฟ้าหัวใจที่ท่านส่งเพื่อให้ระบบประมวลผล
                  </LI>
                  <LI>
                    เราจะไม่เก็บและใช้ข้อมูลที่มีความสะเอียดอ่อนทางเชื้อชาติหรือพันธุ์
                    เช่น เชื้อชาติ ความเชื่อทางศาสนา ประวัติอาชญากรรม
                    เว้นแต่เป็นไปตามที่ข้อบังคับและกฎหมายกำหนด
                    หรือโดยความยินยอมของท่าน
                  </LI>
                </OL>
              </Box>

              <Box>
                <H>วัตถุประสงค์ในการประมวลผลข้อมูลส่วนบุคคล</H>
                <T>
                  เราอาจประมวลผลข้อมูลของท่านโดยอาศัยความยินยอมของท่าน
                  หรือการปฏิบัติตามสัญญาระหว่างกัน หรือการใด ๆ
                  เพื่อประโยชน์โดยชอบด้วยกฎหมายของเรา สำหรับวัตถุประสงค์ดังนี้
                </T>
                <OL>
                  <LI>
                    วัตถุประสงค์เกี่ยวกับการให้บริการทางการแพทย์ได้แก่
                    <UL>
                      <LI>
                        พัฒนาให้ระบบและแบบประเมินความเสี่ยงมีประสิทธิภาพมากยิ่งขึ้น
                      </LI>
                      <LI>
                        จัดหาบริการสำหรับโรงพยาบาลหรือการเข้าถึงข้อมูลเพื่อพัฒนาระบบบริการผ่านแอพพลิเคชั่นให้ดียิ่งขึ้น
                        รองรับข้อมูลที่หลากหลายยิ่งขึ้น
                      </LI>
                      <LI>
                        การประสานงานและส่งต่อข้อมูลให้กับโรงพยาบาลที่ใช้งานแอพพลิเคชั่น
                      </LI>
                      <LI>ปฏิบัติตามกฎของโรงพยาบาล</LI>
                      <LI>
                        ปฏิบัติตามกฎหมาย ข้อกำหนด ระเบียบ ข้อบังคับ
                        หรือการร้องขอใดๆ จากหน่วยงานภาครัฐ เช่น
                        การปฏิบัติตามหมายเรียกพยาน หรือคำสั่งศาล
                        หรือการร้องขออื่นๆ ที่ถูกต้องตามกฎหมาย
                      </LI>
                      <LI>
                        วัตถุประสงค์อื่นๆ
                        ที่สนับสนุนการดำเนินการตามวัตถุประสงค์ข้างต้น
                        หรือที่ได้รับความยินยอมจากท่านเป็นครั้งคราว
                      </LI>
                    </UL>
                  </LI>
                  <LI>
                    วัตถุประสงค์เกี่ยวกับการตลาดของเรา
                    ซึ่งเราจะประมวลผลเพื่อวัตถุประสงค์เหล่านี้เฉพาะกรณีที่ท่านได้ให้ความยินยอมในการประมวลผลแก่เรา
                    ได้แก่
                    <UL>
                      <LI>
                        อำนวยความสะดวกและนำเสนอข้อมูล
                        และเก็บข้อมูลที่เป็นประโยชน์ต่อผู้ใช้งาน
                      </LI>
                      <LI>
                        สำรวจความพึงพอใจของผู้ใช้งาน วิจัยตลาด
                        และวิเคราะห์ทางสถิติ
                        เพื่อเป็นข้อมูลในการปรับปรุงผลิตภัณฑ์และบริการ
                        หรือสร้างสรรค์ผลิตภัณฑ์และบริการใหม่ ๆ
                      </LI>
                      <LI>
                        เพื่อเป็นช่องทางในการสื่อสาร ตอบคำถาม
                        หรือตอบสนองข้อร้องเรียนที่เกี่ยวข้องกับการใช้บริการของเรา
                        เช่น ปัญหาการใช้บริการ
                      </LI>
                    </UL>
                  </LI>
                </OL>
              </Box>

              <Box>
                <H>บุคคลที่ข้อมูลส่วนบุคคลอาจถูกเปิดเผย</H>
                <T>
                  เราอาจเปิดเผยหรือถ่ายโอนข้อมูลส่วนบุคคลของท่านไปยังบุคคลที่สาม
                  ซึ่งอาจตั้งอยู่ภายในหรือนอกประเทศไทย
                  ซึ่งเป็นประเทศที่มีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลอย่างเพียงพอและเป็นไปตามหลักเกณฑ์การให้ความคุ้มครองข้อมูลส่วนบุคคลที่กฎหมายกำหนด
                  และเราจะดำเนินตามมาตรการที่จำเป็นและเหมาะสม
                  หรือเป็นไปตามข้อบังคับและกฎหมาย
                  เพื่อวัตถุประสงค์ที่ตามระบุไว้ข้างต้น ให้แก่บุคคลดังต่อไปนี้
                </T>
                <UL>
                  <LI>โรงพยาบาลศิริราชและคณะวิศวกรรมศาสตร์มหาวิทยาลัยมหิดล</LI>
                  <LI>คณะผู้จัดทำแอพพลิเคชั่น</LI>
                  <LI>เจ้าหน้าที่ หรือหน่วยงานรักษาความมั่นคงและความปลอดภัย</LI>
                  <LI>
                    หน่วยงานภาครัฐ หน่วยงานกำกับดูแล และหน่วยงานอื่นๆ
                    ตามที่กฎหมายอนุญาต หรือกำหนดไว้
                  </LI>
                </UL>
              </Box>

              <Box>
                <H>การเชื่อมโยงไปยังเว็บไซต์บุคคลที่สาม</H>
                <T>
                  เว็บไซต์และแอพพลิเคชั่นบนมือถือของเรา
                  อาจมีลิงก์เชื่อมไปยังเว็บไซต์บุคคลที่สาม
                  เช่นการลงทะเบียนสมัครใช้งาน หากท่านไปตามลิงก์เหล่านี้
                  นโยบายความเป็นส่วนตัวนี้ไม่ครอบคลุมไปถึงเว็บไซต์ของบุคคลที่สาม
                  ดังนั้นการที่บุคคลที่สามประมวลผลข้อมูลส่วนบุคคลของท่านจึงอยู่นอกเหนือการควบคุมของเรา
                  และโปรดทราบว่าเราไม่มีส่วนเกี่ยวข้องและความรับผิดใดๆ
                  จากการกระทำของบุคคลที่สามดังกล่าว
                </T>
              </Box>

              <Box>
                <H>การเก็บรักษาข้อมูลส่วนบุคคลและความปลอดภัย</H>
                <T>
                  ข้อมูลส่วนบุคคลของท่านจะถูกเก็บรักษาไว้นานเท่าที่จำเป็นเพื่อวัตถุประสงค์ต่าง
                  ๆ ที่อธิบายไว้ในนโยบายความเป็นส่วนตัวนี้
                  หรือภายใต้ข้อบังคับของกฎหมาย หรือเพื่อการดำเนินการทางกฎหมาย
                  เมื่อพ้นระยะเวลาดังกล่าวแล้ว
                  หากท่านไม่แสดงความยินยอมให้เราทำการประมวลผลข้อมูลส่วนบุคคลของท่านต่อไป
                  เราจะดำเนินการทำลายข้อมูลส่วนบุคคลนั้นตามขั้นตอนการทำลายข้อมูลของเราและจะดำเนินการให้เสร็จโดยไม่ชักช้า
                </T>
                <T>
                  เราจะใช้มาตรการทางเทคนิค
                  และการบริหารจัดการที่เหมาะสมเพื่อป้องกันและรักษาความปลอดภัยของข้อมูลส่วนบุคคลของท่านที่เราเก็บรวบรวม
                  เช่น เราใช้โปรโตคอลความปลอดภัย (Secure Sockets Layer: SSL) และ
                  Third-party authentication
                  สำหรับการเข้ารหัสข้อมูลผ่านทางอินเตอร์เน็ต
                  และเราจะจำกัดการเข้าถึงข้อมูลของท่าน
                  ไม่ว่าที่จัดเก็บในระบบอินเตอร์เน็ตหรือในรูปแบบเอกสารไว้เฉพาะบุคลากรที่มีความจำเป็นต้องประมวลผลข้อมูลส่วนบุคคลนั้น
                  และจัดเก็บในสถานที่ที่มีระบบป้องกันการเข้าถึงโดยจำกัดบุคคลที่สามารถเข้าถึงได้สำหรับข้อมูลส่วนบุคคลที่อยู่ในรูปแบบเอกสาร
                </T>
              </Box>

              <Box>
                <H>สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน</H>
                <T>
                  ท่านอาจติดต่อเรา/เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล/เจ้าหน้าที่ที่เกี่ยวข้องเพื่อยื่นคำร้องขอดำเนินการใช้สิทธิของท่านดังต่อไปนี้
                </T>
                <UL>
                  <LI>
                    ถ้าท่านสมัครใช้งานแอพพลิเคชั่นกับเรา
                    ท่านมีสิทธิเข้าถึงข้อมูลของท่านที่เราเก็บรักษาไว้
                    รวมถึงขอรับสำเนาข้อมูลและขอให้โอนย้ายข้อมูลส่วนบุคคลของท่านที่ท่านให้ไว้กับเราไปยังผู้ควบคุมข้อมูลรายอื่นหรือตัวท่านเอง
                  </LI>
                  <LI>
                    ท่านมีสิทธิคัดค้าน หรือระงับการเก็บรวบรวม ใช้
                    หรือเปิดเผยข้อมูลของท่านได้
                  </LI>
                  <LI>
                    ท่านมีสิทธิขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้อง
                    หรือเพิ่มเติมข้อมูลที่ไม่สมบูรณ์ได้ และอาจขอให้เราลบ
                    หรือทำลาย
                    หรือเปิดเผยแหล่งที่มาของข้อมูลของท่านในกรณีที่ไม่ได้ให้ความยินยอมได้
                  </LI>
                  <LI>
                    ในกรณีที่ท่านพบว่าเรา หรือบุคลากรของเราใช้
                    หรือเปิดเผยข้อมูลของท่าน
                    ไม่เป็นไปตามที่ท่านได้ให้ความยินยอมไว้หรือไม่เป็นการประมวลผลตามที่มีสิทธิตามกฎหมาย
                    ท่านมีสิทธิร้องเรียนต่อคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลได้
                  </LI>
                  <LI>
                    ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลตามที่ท่านได้ให้ความยินยอมกับเราได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา
                    เว้นแต่มีข้อจำกัดสิทธิในการเพิกถอนความยินยอมโดยกฎหมายหรือโดยสัญญาที่ให้ประโยชน์แก่ท่าน{" "}
                  </LI>
                  <LI>
                    อย่างไรก็ตาม
                    การที่ท่านได้เพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลใดอาจส่งผลให้เรามีข้อมูลไม่เพียงพอต่อการประมวลผลให้บรรลุวัตถุประสงค์ตามที่ได้แจ้ง
                    และท่านอาจขาดความสะดวกในการได้รับบริการจากเรา
                  </LI>
                </UL>
              </Box>

              <Box>
                <H>ช่องทางการติดต่อเรา</H>
                <T>
                  หากท่านต้องการใช้สิทธิใดๆตามนโยบายความเป็นส่วนตัวนี้
                  กรุณาดำเนินการเป็นลายลักษณ์อักษร
                  พร้อมแนบสำเนาหลักฐานเพื่อแสดงตัวตน และหากท่านมีคำถาม
                  ข้อเสนอแนะ ข้อร้องเรียนเกี่ยวกับนโยบายความเป็นส่วนตัว
                  สามารถติดต่อได้ตามที่อยู่นี้
                </T>
                <BQ>
                  ศูนย์โรคหัวใจ โรงพยาบาลศิริราช คณะแพทยศาสตร์ศิริราชพยาบาล
                  เลขที่ 2 ถนนวังหลัง แขวงศิริราช เขตบางกอกน้อย กรุงเทพฯ 10700
                </BQ>
                <T>หรือ</T>
                <BQ>
                  คณะวิศวกรรมศาสตร์ มหาวิทยาลัยมหิดล ชั้น 3 อาคาร 3
                  คณะวิศวกรรมศาสตร์ 999 ถ.พุทธมณฑลสาย 4 ต.ศาลายา อ.พุทธมณฑล
                  จ.นครปฐม 73170
                </BQ>
                <UL>
                  <LI>
                    ชื่อ สกุล เลขที่บัตรประจำตัวประชาชน / เลขหนังสือเดินทาง
                  </LI>
                  <LI>
                    เรื่องที่ต้องการติดต่อสอบถาม
                    รายละเอียดของข้อผิดพลาดที่เกิดขึ้น
                  </LI>
                  <LI>
                    เบอร์โทรและที่อยู่ที่สามารถติดต่อได้
                    รวมทั้งที่อยู่สำหรับการส่งจดหมายอิเล็กทรอนิกส์ ( E-mail)
                    ของท่าน
                  </LI>
                </UL>
              </Box>

              <Box>
                <H>การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว</H>
                <T>
                  เราอาจทบทวนและเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราวเพื่อให้สอดคล้องกับการเปลี่ยนแปลงของการให้บริการและการดำเนินงานของเรา
                  ข้อเสนอแนะและความคิดเห็นจากท่าน รวมถึงข้อกฎหมายที่เกี่ยวข้อง
                  โดยนโยบายเวอร์ชั่นล่าสุดจะประกาศบนเว็บไซต์ของเราโดยที่ท่านสามารถเข้ามาค้นหาข้อมูลได้เสมอ
                  เพื่อให้ท่านทราบแนวทางที่เราใช้ในการปกป้องข้อมูลส่วนบุคคลของท่าน
                </T>
                <T>
                  นโยบายความเป็นส่วนตัวนี้ มีผลใช้บังคับตั้งแต่วันที่ 30 เมษายน
                  2565
                </T>
              </Box>
            </VStack>
          </Box>
        </VStack>
      </Box>
    </Layout>
  );
};

export default PrivacyPolicy;
